import numpy as np

arr1 = np.array([[1, 2, 3], [4, 5, 6]])
arr2 = np.array([[7, 8, 9], [10, 11, 12]])
# 基本运算示例
# 加法
print(arr1 + arr2)

# 如果两个数组的形状不同，但可以广播，则会自动进行广播运算
arr3 = np.array([1, 2, 3]) # 生成一个一维数组，用于广播运算
print(arr1 + arr3)
# [[2 4 6]
#  [5 7 9]]
# 广播运算示例
arr4 = np.array([[1], [2]])
print(arr1 + arr4) # 广播运算，将arr4的每一行加到arr1的对应行上
# [[2 3 4]
#  [6 7 8]]

# 如果两个数组的形状在任何一个维度上都不匹配，
# 数组的形状会沿着元素个数为1的维度开始扩展，直到所有的维度都一样，以匹配另一个数组的形状
arr3 =np.array([[4],[5],[6]]) # 三行一列
arr4 = np.array([1,2,3]) # 一行三列
print(arr3 + arr4) # 广播运算，将arr4的每一行加到arr3的对应行上
# [[5 6 7]
#  [6 7 8]
#  [7 8 9]]

# 规则3：如果俩个数组的形状在任何一个维度上都不匹配，
# 并且没有任何一个维度大小等于1，那么会引发异常
arr5 = np.array([[1, 2], [3, 4]]) #两行两列
arr6 = np.array([[1, 2, 3]]) #一行三列
# print(arr5 + arr6) # 会引发异常，因为形状不匹配且没有维度为1